1C_config/src/Documents/ВводНачальныхОстатков/ВводНачальныхОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводНачальныхОстатков</name>
  <registerRecords>AccumulationRegister.ОстаткиНаСчетах</registerRecords>
  <tabularSections>
    <name>Остатки</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

1C_config/src/AccumulationRegisters/ОстаткиНаСчетах/ОстаткиНаСчетах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНаСчетах</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

1C_config/src/Documents/ВводНачальныхОстатков/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    
    Дата = ТекущаяДата();
    
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    // Фиксируем пометку на удаление 
    Если ПометкаУдаления И Не ЭтоНовый() И Не Ссылка.ПометкаУдаления Тогда
        Комментарий = "Документ №" + Номер + " помечен на удаление";
        Журналирование.ЗаписатьДействие(Ссылка, "Пометка на удаление", Комментарий);
    КонецЕсли;
    
    // Фиксируем снятие пометки 
    Если Не ПометкаУдаления И Не ЭтоНовый() И Ссылка.ПометкаУдаления Тогда
        Комментарий = "Снята пометка удаления с документа №" + Номер;
        Журналирование.ЗаписатьДействие(Ссылка, "Снятие пометки на удаление", Комментарий);
    КонецЕсли;
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    // есть ли строки в табличной части
    Если Остатки.Количество() = 0 Тогда
        Отказ = Истина;
        Сообщить("Ошибка: не указаны остатки для ввода");
        Возврат;
    КонецЕсли;
    
    Движения.ОстаткиНаСчетах.Очистить();
    
    Для Каждого Строка Из Остатки Цикл
        Движение = Движения.ОстаткиНаСчетах.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.Счет = Строка.Счет;
        Движение.Сумма = Строка.СуммаОстатка;
    КонецЦикла;
    
    Движения.ОстаткиНаСчетах.Записывать = Истина;
    
    // Запись в журнал аудита
    Комментарий = "Ввод остатков на " + Остатки.Количество() + " счетов";
    Журналирование.ЗаписатьДействие(Ссылка, "Проведение", Комментарий);
    
КонецПроцедуры

Процедура ОбработкаУдаления(Отказ, РежимУдаления)
    
    // Запись в в журнал аудита о физическом удалении
    Комментарий = "Документ №" + Номер + " физически удален из базы";
    Журналирование.ЗаписатьДействие(Ссылка, "Физическое удаление", Комментарий);
    
КонецПроцедуры
